#+TITLE: Emacs Literate Configuration
#+AUTHOR: Youssef Sahli
#+STARTUP: overview
#+Property: header-args :tangle yes

** Fortune
We import a fortune file to display on the [[*Dashboard][Dashboard]] from github.
#+BEGIN_SRC emacs-lisp
  (let ((fortune-path (concat user-emacs-directory "showerthoughts"))
        (fortune-url "https://raw.githubusercontent.com/JKirchartz/fortunes/refs/heads/master/showerthoughts"))
    (unless (file-exists-p fortune-path)
      (url-copy-file fortune-url fortune-path t))
    (setq cookie-file fortune-path))
#+END_SRC

#+RESULTS:
: ~/.emacs.d/showerthoughts

